### Tabula is a PDF table extraction tool writen in Java. Although there are multiple wrappers in R, Ruby, and Node.js, there isn't any python wrapper available yet till recently.  I have been looking for a while and luckly is now available for python as documented in [chezou's github](https://github.com/chezou/tabula-py) and [Aki Ariga's blog](https://blog.chezo.uno/tabula-py-extract-table-from-pdf-into-python-dataframe-6c7acfa5f302).

I have done some simple test. It works great!

In [1]:
from tabula import read_pdf
import pandas as pd

In [2]:
help(read_pdf)

Help on function read_pdf in module tabula.wrapper:

read_pdf(input_path, output_format='dataframe', encoding='utf-8', java_options=None, pandas_options=None, multiple_tables=False, **kwargs)
    Read tables in PDF.

    Args:
        input_path (str):
            File path of tareget PDF file.
        output_format (str, optional):
            Output format of this function (dataframe or json)
        encoding (str, optional):
            Encoding type for pandas. Default is 'utf-8'
        java_options (list, optional):
            Set java options like `-Xmx256m`.
        pandas_options (dict, optional):
            Set pandas options like {'header': None}.
        multiple_tables (bool, optional):
            This is experimental option. It enables to handle multple tables within a page.
            Note: If `multiple_tables` option is enabled, tabula-py uses not `pd.read_csv()`,
             but `pd.DataFrame()`. Make sure to pass appropreate `pandas_options`.
        kwargs (dict):
            Dictionary of option for tabula-java. Details are shown in `build_options()`

    Returns:
        Extracted pandas DataFrame or list.

In [3]:
df1 = read_pdf('singletable.pdf',output_format='dataframe', encoding='utf-8', java_options=None, )
df1

   Number State Code  State Name
0       1         NY    New York
1       2         MD    Maryland
2       3         VA    Virginia
3       4         AK      Alaska
4       5         AL     Alabama
5       6         AR    Arkansas
6       7         AZ     Arizona
7       8         CA  California
8       9         IA        Iowa

In [4]:
df2 = read_pdf('twotablesinsinglepage.pdf')
df2

    Number    State Code                 State Name
0        1            NY                   New York
1        2            MD                   Maryland
2        3            VA                   Virginia
3        4            AK                     Alaska
4        5            AL                    Alabama
5        6            AR                   Arkansas
6        7            AZ                    Arizona
7        8            CA                 California
8        9            IA                       Iowa
9   Number  Country Code               Country Name
10       1           USA  United States of American
11       2           ARG                   Argentia
12       3           AUS                 Austrialia
13       4           BRA                     Brazil
14       5           CHN                      China
15       6           DEU                    Germany
16       7           IND                      India
17       8           JPN                      Japan
18       9           MEX                     Mexico

In [5]:
df3 = read_pdf('twotablesinsinglepage.pdf', multiple_tables = True)
type(df3)

list

In [6]:
len(df3)

2

In [10]:
df3[0]

        0           1           2
0  Number  State Code  State Name
1       1          NY    New York
2       2          MD    Maryland
3       3          VA    Virginia
4       4          AK      Alaska
5       5          AL     Alabama
6       6          AR    Arkansas
7       7          AZ     Arizona
8       8          CA  California
9       9          IA        Iowa

In [11]:
df3[0][1:]

   0   1           2
1  1  NY    New York
2  2  MD    Maryland
3  3  VA    Virginia
4  4  AK      Alaska
5  5  AL     Alabama
6  6  AR    Arkansas
7  7  AZ     Arizona
8  8  CA  California
9  9  IA        Iowa

In [35]:
df3[0][:1].loc[0,:].tolist()

['Number', 'State Code', 'State Name']

In [37]:
df4 = df3[0][1:]
df4.columns=df3[0][:1].loc[0,:].tolist()
df4

  Number State Code  State Name
1      1         NY    New York
2      2         MD    Maryland
3      3         VA    Virginia
4      4         AK      Alaska
5      5         AL     Alabama
6      6         AR    Arkansas
7      7         AZ     Arizona
8      8         CA  California
9      9         IA        Iowa

In [44]:
df5 = read_pdf('twotablesintwopages.pdf', multiple_tables = True, pages="1-2")
type(df5)

list

In [45]:
len(df5)

2

In [47]:
df5[1]

        0             1                          2
0  Number  Country Code               Country Name
1       1           USA  United States of American
2       2           ARG                   Argentia
3       3           AUS                 Austrialia
4       4           BRA                     Brazil
5       5           CHN                      China
6       6           DEU                    Germany
7       7           IND                      India
8       8           JPN                      Japan
9       9           MEX                     Mexico

In [48]:
df6 = df5[1][1:]
df6.columns=df5[1][:1].loc[0,:].tolist()
df6

  Number Country Code               Country Name
1      1          USA  United States of American
2      2          ARG                   Argentia
3      3          AUS                 Austrialia
4      4          BRA                     Brazil
5      5          CHN                      China
6      6          DEU                    Germany
7      7          IND                      India
8      8          JPN                      Japan
9      9          MEX                     Mexico